In [2]:
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('SQLite_count_test_db.db')

In [14]:
cursor = conn.cursor()
cursor.execute('select * from sqlite_master where type = "table"')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
data_df = pd.DataFrame(data, columns=columns)
cursor.close()

In [15]:
data_df

,type,name,tbl_name,rootpage,sql
0,table,Tab1,Tab1,2,"CREATE TABLE ""Tab1"" (\n""index"" INTEGER,\n ""Co..."

In [24]:
cursor = conn.cursor()
cursor.execute('select * from Tab1')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
data_df = pd.DataFrame(data, columns=columns)
cursor.close()

In [25]:
data_df

   index Col1
0      0    a
1      1    a
2      2    a
3      3    b
4      4    b
5      5    c
6      6    č
7      7    á
8      8    A
9      9    Č

In [34]:
cursor = conn.cursor()
cursor.execute('select count (*) as count from Tab1')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
data_df = pd.DataFrame(data, columns=columns)
cursor.close()

In [35]:
data_df

   count
0     10

In [32]:
cursor = conn.cursor()
cursor.execute('select Col1, count (*) as count from Tab1 group by "Col1"')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
data_df = pd.DataFrame(data, columns=columns)
cursor.close()

In [33]:
data_df

  Col1  count
0    A      1
1    a      3
2    b      2
3    c      1
4    á      1
5    Č      1
6    č      1